app/controllers/articles_controller.rb

  def index
    @articles = Articles.all
---
SELECT "articles".* FROM "articles"